src/Catalogs/ТоварныеГруппы/ТоварныеГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТоварныеГруппы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НумераторMAC</name>
    <type>
      <types>CatalogRef.НумераторMAC</types>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТаблицуПараметровДатчиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоMACАдресов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрупповаяУпаковка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШаблоныПечатныхДокументов</name>
    <attributes>
      <name>Шаблон</name>
      <type>
        <types>CatalogRef.ШаблоныПечатныхДокументов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ПараметрыТоварныхГрупп/ПараметрыТоварныхГрупп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыТоварныхГрупп</name>
  <resources>
    <name>ЗначениеПараметра</name>
    <type>
      <types>Characteristic.ПараметрыТоварныхГрупп</types>
    </type>
  </resources>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрТоварнойГруппы</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПараметрыТоварныхГрупп</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ТоварныеГруппы/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
ПараметрыТоварныхГрупп.Параметры.УстановитьЗначениеПараметра("ТоварнаяГруппа",Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура КопироватьПараметрыНаСервере(ТоварнаяГруппа)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыТоварныхГрупп.ТоварнаяГруппа,
	|	ПараметрыТоварныхГрупп.ПараметрТоварнойГруппы,
	|	ПараметрыТоварныхГрупп.ЗначениеПараметра
	|ИЗ
	|	РегистрСведений.ПараметрыТоварныхГрупп КАК ПараметрыТоварныхГрупп
	|ГДЕ
	|	ПараметрыТоварныхГрупп.ТоварнаяГруппа = &ТоварнаяГруппа";
Запрос.УстановитьПараметр("ТоварнаяГруппа", ТоварнаяГруппа);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ПТГ = РегистрыСведений.ПараметрыТоварныхГрупп.СоздатьМенеджерЗаписи();
	ПТГ.ТоварнаяГруппа = Объект.Ссылка;
	ПТГ.ПараметрТоварнойГруппы = ВыборкаДетальныеЗаписи.ПараметрТоварнойГруппы;
	ПТГ.ЗначениеПараметра = ВыборкаДетальныеЗаписи.ЗначениеПараметра;
	ПТГ.Записать(Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КопироватьПараметры(Команда)
	Если Не ЭтаФорма.Модифицированность Тогда
	ТоварнаяГруппа = Объект.Ссылка;
		Если ВвестиЗначение(ТоварнаяГруппа,"Выберите товарную группу",Новый ОписаниеТипов("СправочникСсылка.ТоварныеГруппы")) Тогда
		КопироватьПараметрыНаСервере(ТоварнаяГруппа);
		ПриОткрытии(Ложь);
		КонецЕсли;
	Иначе
	Сообщить("Сначала запишите элемент!");
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура КопироватьШаблоныНаСервере(ТоварнаяГруппа)
	Для каждого ТЧ Из ТоварнаяГруппа.ШаблоныПечатныхДокументов Цикл	
	ТЧ_Шаблон = Объект.ШаблоныПечатныхДокументов.Добавить();
	ТЧ_Шаблон.Шаблон = ТЧ.Шаблон;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура КопироватьШаблоны(Команда)
	Если Не ЭтаФорма.Модифицированность Тогда
	ТоварнаяГруппа = Объект.Ссылка;
		Если ВвестиЗначение(ТоварнаяГруппа,"Выберите товарную группу",Новый ОписаниеТипов("СправочникСсылка.ТоварныеГруппы")) Тогда
		КопироватьШаблоныНаСервере(ТоварнаяГруппа);
		ПриОткрытии(Ложь);
		КонецЕсли;
	Иначе
	Сообщить("Сначала запишите элемент!");
	КонецЕсли;
КонецПроцедуры
